{"keras_version": "2.1.5", "config": [{"class_name": "Masking", "config": {"dtype": "float32", "name": "masking_1", "mask_value": -1, "batch_input_shape": [null, 3, 23], "trainable": true}}, {"class_name": "LSTM", "config": {"batch_input_shape": [null, 3, 23], "dropout": 0.2, "trainable": true, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "return_state": false, "use_bias": true, "recurrent_regularizer": null, "implementation": 1, "name": "lstm_1", "unit_forget_bias": true, "kernel_constraint": null, "unroll": false, "dtype": "float32", "bias_regularizer": null, "recurrent_constraint": null, "stateful": false, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false}}, {"class_name": "Dense", "config": {"name": "dense_1", "batch_input_shape": [null, 32], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 12, "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "backend": "tensorflow", "class_name": "Sequential"}