{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.5", "config": [{"class_name": "Masking", "config": {"dtype": "float32", "trainable": true, "mask_value": -1, "batch_input_shape": [null, 3, 23], "name": "masking_1"}}, {"class_name": "LSTM", "config": {"go_backwards": false, "recurrent_dropout": 0.0, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "unit_forget_bias": true, "activity_regularizer": null, "units": 32, "batch_input_shape": [null, 3, 23], "return_sequences": false, "trainable": true, "recurrent_constraint": null, "dtype": "float32", "unroll": false, "name": "lstm_1", "recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.2, "use_bias": true, "implementation": 1, "activation": "tanh", "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "return_state": false}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 12, "batch_input_shape": [null, 32], "activation": "linear", "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}]}